Map<int, Map<String, dynamic>> mapIndexToData = {
  0: {
    'content': str1,
    'title': '臨時會員入會申請辦法說明',
    'subtitles': [
      '臨時會員入會申請辦法說明',
    ],
  },
  1: {
    'content': str2,
    'title': '活動報名暨活動注意事項',
    'subtitles': [
      '臨時會員入會申請辦法說明',
    ],
  },
  2: {
    'content': str3,
    'title': '新北山岳協會隱私權政策',
    'subtitles': [
      '臨時會員入會申請辦法說明',
    ],
  },
  3: {
    'content': str4,
    'title': '個人資料供特定目的使用之同意',
    'subtitles': [
      '臨時會員入會申請辦法說明',
    ],
  },
};

String str1 = '''臨時會員入會申請辦法說明
1.本會之登山正式會員報名參加享有優惠，臨時會員非正式會員依原價收費。
2.此頁目前加入的為臨時會員，申請為正式會員請資料填妥後通知會籍組人員進行變更資料認定。
3.臨時會員，不需加入申請費用，但須填具正確之個人身分資料。

臨時會員要轉正式會員除需繳納常年會費（新臺幣500元）外尚需加收手續費100元。辦理入會申請時，如為親至協會辦理者須準備有效證件(身分證或駕照或健保卡等有照片之證件驗證身份使用（辦理入山申請時專用）)，並於協會制式表單正確填寫申請表：姓名、性別、出生地、血型、出生日期、身分證號、通訊地址、戶籍地址、聯絡電話（家、手機、公司）、緊急聯絡人及電話。
''';

//新北山岳協會活動報名注意事項

String str2 = '''活動報名暨活動注意事項
1.郊山活動行程，除特別備註需報名外，一律免報名，請斟酌自己的腳程，自由參加。自備午餐、飲水、手套、雨具、 頭燈、禦寒衣物、簡單醫療用品。
2.各項收費活動即日起受理報名，額滿為止，行前會議於本會館六樓舉行。
3.報名活動時請核對繳費收據上的地址及聯絡電話是否正確。非會員報名收費活動時，請填寫姓名、性別、身份證號碼、通訊地址、聯絡電話（家、手機、公司）、緊急聯絡人及電話。
4.報名後，不能參加行前會議者，得向領隊請假，並於會後主動與領隊連繫活動需知事項。無故不參加者，領隊可以拒絕其參加。
5.如果領隊認為參加者不適宜參加該活動時，可拒絕其參加；行進中視隊員體能狀況要求其中途折返時，參加隊員不得有異議。
6.收費活動均辦理平安保險，均有投保意外險及醫療保險；依保險法規，81歲以上有最高投保額請注意，14歲以下亦依據保險當時法規的定義。如若認為保額不足，可自行加保。
7.分攤費用之活動行程，參加會員需自行投保。
8.活動報名後因故不能參加活動，退費規定為：行前會議前可全額退費；行前會議召開後，一律不退費。無故未參加活動或活動中途離隊者，一律不退費。退費需持收據到會辦理。
9.各項活動務必準時到達集合地點，逾時不候，且不得要求退費。
10.各項活動出發前如遇颱風或坍方等天然災害，請等候領隊通知，酌情順延或取消。
11.收費活動如遇物價波動或該車次人數不足時，視實際開支酌情補收費用或取消活動。
12.活動進行時，請維護當地環境清潔，遵守當地管制區規定，勿任意破壞自然生態環境，行進間應聽從領隊及嚮導指揮調度。
13.隊員若有心血管、糖尿病、高血壓、氣喘等特別疾病，參加活動前請告知領隊嚮導。
14.未開放路線之入山入園登山活動，本會絕對不允許私下辦理簽帶活動，若有本會嚮導私辦該區入山活動，其所延伸後果，本會概不予負責。
''';

// 新北山岳協會隱私權政策
String str3 = '''
1.  隱私權政策簡介
本隱私權政策說明新北山岳協會 （「本協會」、「我們」）如何處理、保護您於使用本協會之服務（「本服務」，見以下「涵蓋服務」之列表）時所提供之資訊，以及您可以如何存取、控管您的資訊。為尊重您的隱私權、保護您的個人資訊，我們將遵循以下基本原則：
1.蒐集您的個人資訊時，我們會清楚指出目的。
2.個人資訊將被蒐集時，我們會事先通知您，以就個人資訊之蒐集、利用、揭露徵詢您的同意。
3.我們僅會蒐集特定目的範圍內必要的個人資訊。
4.除非經您的同意或基於法律要求，否則我們僅會針對蒐集目的利用或揭露您的個人資訊，且所蒐集之資訊僅會於蒐集目的完成之所需期間內保留。
5.我們將盡力確保您個人資訊的精確性、完整性、和即時性。
6.我們將以適當的安全保護措施保護您的個人資訊。
7.我們會盡力使處理個人資訊的政策與措施公開透明。
8.您隨時可以存取您的個人資訊並進行適當的修改。
9.我們將會對您負責。您可以隨時針對我們是否遵循上述原則與此隱私權政策提出意見。


2. 本協會蒐集何種資訊？如何蒐集資訊？
為提供您使用本服務，我們將於必要範圍內取得您的資訊。我們所蒐集的資訊基本上有兩種：
a.  您提供的資訊
- 用戶提供之個人資料與註冊資訊
為提供用戶流暢的服務體驗，並促進用戶間更良好的交流，用戶可能會被要求註冊用戶資訊，如電話號碼、電子郵件地址、郵遞區號或郵寄／貨運地址或其他與本服務有關而得直接或間接識別用戶之個人資料。
- 促銷活動
為進行問卷調查、抽獎與其他促銷活動，我們可能會要求您提供詳細資訊，如姓名、地址、電話號碼、電子郵件地址、性別、生日，便於頒發獎品、寄送購買商品等。
- 用戶聯絡資訊
當用戶透過線上詢問表單方式聯絡我們時，為檢查回報問題並提供適當回應，我們會蒐集用戶的資訊（包括電子郵件地址、裝置類型、作業系統類型等）以識別用戶。
- 交易及付款資訊
為處理購物與支付服務的相關交易服務或付款程序，因應相關服務所生之交易資料、付款金額與方式、用戶的信用卡資訊可能會被取得。請注意，購物程序應由適當的付款機構完成，我們不會保留任何信用卡資訊。



b. 您使用本服務時，我們所取得的資訊
- 您的用戶內部識別碼
用於確認用戶身分、避免未經授權的用戶使用本服務，以及透過您的帳號連結本服務。
- Cookies
為向用戶提供最佳服務，並維護服務與使用安全，我們可能會使用 Cookies儲存用戶設定以記錄存取功能，並監控使用模式及數據。例如，我們可能會使用Google Analytics協助我們進行上述工作。您可以選擇停用Cookies，但同時您將無法使用本服務的部分功能。
- 記錄
存取本服務時，可能會自動取得並儲存您的使用紀錄(如：功能點擊、服務關閉或使用時間等等)、IP 位址、瀏覽器類型、瀏覽器語言等存取記錄資訊。該資訊將用以分析您的用戶環境，以便我們提升本服務，並避免未經授權／盜用行為干擾本服務正常運作。
- 裝置資訊
我們可能會不定時取得您的裝置資訊（如應用程式版本、作業系統版本、語言與國家設定、裝置型號）。此資訊將用於提昇本服務品質，並避免非法或不當使用。
您得自行決定是否提供您的個人資訊予我們，然若您未提供這些資訊，您將無法使用本服務之部分功能。



3. 本協會會如何利用蒐集到的資訊？
本協會基於下列目的利用所蒐集之資訊：


- 為用戶提供平穩流暢的本服務；
- 認證您的身分；
- 避免未經授權使用／盜用或濫用本服務；
- 提昇或優化本服務；
- 為提供客戶支援，有效回應用戶的疑問與訴求；
- 進行用戶滿意度調查；
- 提供本服務等相關資訊，以及與本協會合作夥伴的廣告或推廣促銷資訊；
- 評估我們放置於網路或其他媒體之廣告效益；
- 為提供或行銷服務、產品及優惠予您，包括但不限於本協會之特別活動及推廣促銷；
- 確認促銷活動得主、頒發獎品、寄送購買商品與類似物品；
- 累積本服務相關的匿名統計資料；
- 用於本服務相關的未來發展；
- 處理支付服務的相關客訴；
- 告知您其他服務相關重要資訊，於必要時與您聯絡；及
- 遵守相關法律與法定義務。

4. 本協會是否分享蒐集到的資訊？
除本隱私權政策（必要時亦包括其他相關隱私權政策與附錄）另有規定者外，未經您的同意，我們不會向第三人提供您的資訊。但若是我們本於善意認為係依據相關法律之要求或許可，或為保護本協會權利及財產而進行抗辯， 則不在此限。

5. 本協會是否與其他服務供應商合作？
本協會可能不定期與服務供應商合作，協助我們為您提供最佳服務。
在與其他服務供應商建立合作關係前，我們會確保服務供應商將依此隱私權政策與相關法律處理您的資訊。

6. 本協會是否使用協力廠商模組？
本協會透過協力廠商廣告代理商在網路或其他媒體上刊登廣告。為評估廣告的效果並決定支付予廣告代理者的金額，我們在應用程式與服務中載入協力廠商模組。我們還可能在應用程式中加入協力廠商模組以協助我們瞭解服務和（或）所有額外服務的使用情況。

7. 如何存取我的資訊或更正我的資訊？
本協會盡力協助您以最輕鬆的方式控管您的資訊。您可以隨時確認或修改您的註冊資訊。
若無法直接於應用程式上確認，您可以隨時寄送書面意見要求本協會確認、更正、刪除其他本協會持有的個人資料 。
認證您的身分後，本協會將依相關法律於合理期限內回應您的要求。

8. 用戶創建內容：關於您上傳的資訊
使用本服務時，您可選擇與其他用戶交換資訊（如個人檔案名稱、圖片及評論）。
請注意，其他用戶可以讀取、蒐集或利用該資訊，若您選擇與其他用戶交換資訊，本協會概不負責。

9. 本協會如何確保本服務的安全性？
我們會持續努力盡可能確保本服務的安全性。
為前述工作進行，若本協會發現服務條款受到侵害、有受侵害之虞，或用戶間發生紛爭，我們的同仁將可能會存取您提供的資訊。

10. 個人資訊會保存多久？
除法律上要求或允許保留較長期間者外，本協會將於達成此隱私權政策所定目的之所需期間內保留您的個人資訊。

11. 個人資訊會儲存在何處？
為提供本服務，本協會將透過位於世界各國安全的伺服器處理並儲存資訊。
若持續使用本服務，表示您同意本協會將您的個人資訊移轉出您所在的國家。

12. 涵蓋服務
本隱私權政策適用於下列服務：
- 本協會所提供的服務或活動

13. 是否有意見？是否有疑問？
若對我們的隱私權政策或處理個人資訊的方式有疑問，請寄信給我們或電洽：
新北山岳協會
收件人：隱私權政策相關
台灣新北市
板橋區陽明街76號5樓
Email：services@thma.org.tw
電話：02-22500059、22501129、22501126

14. 隱私權政策修改相關說明
我們將可能不定時修改隱私權政策，以因應本服務與相關法律規範之變更。此隱私權政策之發布日為2023年04月10日。若隱私權政策有重大變更，我們將透過應用程式及/或其他方式通知您。您可以隨時透過應用程式及本協會官網查看我們的隱私權政策。如您繼續使用本服務，將視為您已同意本協會對於隱私權政策之修改。

''';

// 個人資料供特定目的使用之同意

String str4 = '''
您於點擊同意按鈕時，即表示您同意本協會得依下述特定目的，蒐集、處理
或利用您的個人資料：
1. 針對依個人資料保護法解釋本協會隱私權政策及本協會臨時入會申請辦法所未包含
之範圍，提供或行銷服務、產品及優惠，包括但不限於本協會之特別活動
（例如公益活動等）及推廣促銷；
2. 進行市場研究、分析及調查，使本協會得以瞭解個人化使用者經驗並決定顧
客偏好及分布，以提供更優化的產品及服務；及/或
3. 任何與上述目的合理相關之特定目的。


個人資料利用之期間、地區、對象及方式：
1. 利用期間：特定目的存續期間或依相關法令所定（例如商業會計法等）或
因執行業務所必須之保存期間或依個別契約就資料之保存所定之保存年限
（以期限最長者為準）。
2. 利用地區：台灣地區。
3. 利用對象與方式：本協會將利用您的個人資料，在符合個人資料保護法相關
法令之前提下，以自動化機器或其他非自動化之利用方式，包括但不限於
建檔、揭露、轉介、交互運用、處理或為其他合理之使用（例如發送行銷
資訊與優惠通知或進行市場研究及分析等）。


當事人權利行使：
1. 依照個人資料保護法第三條規定，您有權就您的個人資料向本協會：
查詢或請求閱覽。
請求製給複製本。
請求補充或更正。
請求停止蒐集、處理或利用。
請求刪除。
2. 如您對於本同意條款有任何疑義或欲行使前述之權利，歡迎透過以下管道
與本協會聯繫：
Email：services@thma.org.tw
電話：02-22500059、22501129、22501126
3. 您得自由選擇是否同意本同意條款，惟如您拒絕同意，本協會依個案情況可
能將無法提供您特定之服務。


您如欲終止本同意，請至『設定』>『服務條款』取消勾選『個人資料供特
定目的使用之同意』，本協會往後將不再針對本同意條款所述之目的，為蒐集、處
理及利用您的個人資料。惟本同意的終止將有系統作業時間。
''';
